---
kind: enumMember
id: F:Autodesk.Revit.DB.Structure.AreaReinforcementLayerType.BottomOrBackMajor
enum: Autodesk.Revit.DB.Structure.AreaReinforcementLayerType
source: html/46b15eb7-46c4-2ed9-df2d-417777518f18.htm
---
# Autodesk.Revit.DB.Structure.AreaReinforcementLayerType.BottomOrBackMajor

Reinforcement layer is on the bottom face of a floor host, or on the back face of a wall host in the major direction.